Зарплата_и_Управление_Персоналом_демо/src/Catalogs/ДокументыБИА/ДокументыБИА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДокументыБИА</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>DefinedType.ГрифДоступаБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУничтожения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <type>
      <types>DefinedType.СсылкаНаИнтегрируемыйОбъектБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение подготовившего</comment>
    <type>
      <types>DefinedType.ПодразделениеБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>DefinedType.ПроектБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уничтожен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭДОДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭДОНаправление</name>
    <comment>Имя значения перечисления НаправленияЭДО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭДОНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЭлектронныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВизыСогласования</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>DefinedType.СотрудникБИА</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>EnumRef.РезультатыСогласованияБИА</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеТабЧасти</name>
    <attributes>
      <name>ИмяТаблицы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиИсточника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодписиДокумента</name>
    <comment>Бумажные подписи и ПЭП</comment>
    <attributes>
      <name>ВидПодписи</name>
      <type>
        <types>EnumRef.ВидыПодписейДокументовБИА</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДоверенности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подписал</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>DefinedType.ПрисоединенныйФайл</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрочиеСвойства</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяСвойства</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеСвойства</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Резолюции</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>DefinedType.СотрудникБИА</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстРезолюции</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Связи</name>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СвязаннаяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СвязанныйДокумент</name>
      <type>
        <types>CatalogRef.ДокументыБИА</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбратнойСвязиИдентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбратнойСвязиНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСвязиИдентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСвязиНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтатусыФайловЭДО</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <comment>Имя значения перечисления СтатусыСообщенийЭДО</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>DefinedType.ПрисоединенныйФайл</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СубъектыПерсональныхДанных</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>DefinedType.ФизическоеЛицоБИА</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиФайловБИА</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРегламентаЭДО</name>
      <comment>Синоним значения перечисления ТипыЭлементовРегламентаЭДО</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>DefinedType.ПрисоединенныйФайл</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлВизуализации</name>
      <type>
        <types>DefinedType.ПрисоединенныйФайл</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Штрихкоды</name>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>39</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Зарплата_и_Управление_Персоналом_демо/src/Enums/ВидыПодписейДокументовБИА/ВидыПодписейДокументовБИА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПодписейДокументовБИА</name>
  <enumValues>
    <name>НаБумаге</name>
  </enumValues>
  <enumValues>
    <name>Простая</name>
  </enumValues>
  <enumValues>
    <name>Усиленная</name>
  </enumValues>
</mdclass:Enum>

Зарплата_и_Управление_Персоналом_демо/src/Catalogs/ДокументыБИА/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() И Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
			ДатаСоздания = ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	Наименование = НаименованиеДокумента(ЭтотОбъект);
	
	Если Не ЭтоНовый() И ПометкаУдаления
		И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления")
		И (Не ДополнительныеСвойства.Свойство("ЭтоОтзывДокумента")
			Или ДополнительныеСвойства.ЭтоОтзывДокумента <> Истина) Тогда
		ВызватьИсключение НСтр("ru = 'Пометка документа для 1С:Архива на удаление может выполняться только при отзыве документа'");
	КонецЕсли
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ДатаСоздания = ТекущаяДатаСеанса();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Типы значений в таб. части ПрочиеСвойства.
	Если ПрочиеСвойства.Количество() > 0 Тогда
		
		ДопустимыеТипы = Новый Соответствие;
		ДопустимыеТипы[Тип("Строка")] = Истина;
		ДопустимыеТипы[Тип("Число")] = Истина;
		ДопустимыеТипы[Тип("Дата")] = Истина;
		ДопустимыеТипы[Тип("Булево")] = Истина;
		ДопустимыеТипы[Тип("СправочникСсылка.ВидыДокументовБИА")] = Истина;
		ДопустимыеТипы[Тип("СправочникСсылка.ДокументыБИА")] = Истина;
		
		ОписанияСсылочныхТипов = Новый Массив;
		ОписанияСсылочныхТипов.Добавить(Метаданные.ОпределяемыеТипы.ГрифДоступаБИА.Тип);
		ОписанияСсылочныхТипов.Добавить(Метаданные.ОпределяемыеТипы.ДолжностьБИА.Тип);
		ОписанияСсылочныхТипов.Добавить(Метаданные.ОпределяемыеТипы.КонтрагентБИА.Тип);
		ОписанияСсылочныхТипов.Добавить(Метаданные.ОпределяемыеТипы.ОрганизацияБИА.Тип);
		ОписанияСсылочныхТипов.Добавить(Метаданные.ОпределяемыеТипы.ПодразделениеБИА.Тип);
		ОписанияСсылочныхТипов.Добавить(Метаданные.ОпределяемыеТипы.ПроектБИА.Тип);
		ОписанияСсылочныхТипов.Добавить(Метаданные.ОпределяемыеТипы.СотрудникБИА.Тип);
		ОписанияСсылочныхТипов.Добавить(Метаданные.ОпределяемыеТипы.ФизическоеЛицо.Тип);
		
		Для Каждого ОписаниеТипа Из ОписанияСсылочныхТипов Цикл
			Для Каждого Тип Из ОписаниеТипа.Типы() Цикл
				ДопустимыеТипы[Тип] = Истина;
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого Стр Из ПрочиеСвойства Цикл
			Если ДопустимыеТипы[ТипЗнч(Стр.Значение)] = Неопределено Тогда
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
					НСтр("ru = 'Недопустимый тип значения свойства ""%1"": %2'"),
					Стр.ИмяСвойства, ТипЗнч(Стр.Значение)));
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Подписи.
	Для Каждого СтрПодписи Из ПодписиДокумента Цикл
		Если ЭтоЭлектронныйДокумент И СтрПодписи.ВидПодписи = Перечисления.ВидыПодписейДокументовБИА.НаБумаге Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
				НСтр("ru = 'Вид подписи ""На бумаге"" недопустим для электронных документов'")));
			Продолжить;
		КонецЕсли;
		Если СтрПодписи.ВидПодписи = Перечисления.ВидыПодписейДокументовБИА.Простая Тогда
			Если Не ЗначениеЗаполнено(СтрПодписи.Подпись.Получить()) Тогда
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
					НСтр("ru = 'Не заполнены двоичные данные ПЭП в строке %1'"),
					СтрПодписи.НомерСтроки));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОбменСАрхивомПереопределяемый.ОбработкаПроверкиЗаполненияДокументаБИА(
		ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗначениеСвойства(Значение, ИмяСвойства, ПредставлениеСвойства = "") Экспорт
	
	СтрокаСвойства = ПрочиеСвойства.Добавить();
	СтрокаСвойства.ИмяСвойства = ИмяСвойства;
	СтрокаСвойства.ПредставлениеСвойства = ?(ЗначениеЗаполнено(ПредставлениеСвойства),
		ПредставлениеСвойства, ИмяСвойства);
	СтрокаСвойства.Значение = Значение;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НаименованиеДокумента(Документ) 
	
	Заголовок = СокрЛП(Документ.Заголовок);
	Если Не ЗначениеЗаполнено(Заголовок) Тогда
		Заголовок = Строка(Документ.ВидДокумента);
	КонецЕсли;
	
	ДлинаНаименования = Документ.Метаданные().ДлинаНаименования;
	
	Если ЗначениеЗаполнено(Документ.Номер)
		И СтрНайти(Заголовок, Документ.Номер) = 0
		И СтрНайти(Заголовок, Формат(Документ.Дата, "ДЛФ=D")) = 0 Тогда 
		Постфикс = " " + СтрШаблон(
			НСтр("ru = '(№ %1 от %2)'"),
			СокрЛП(Документ.Номер),
			Формат(Документ.Дата, "ДЛФ=D"));
	Иначе
		Постфикс = "";
	КонецЕсли;
	
	ДлинаПостфикса = СтрДлина(Постфикс);
	Если СтрДлина(Заголовок) + ДлинаПостфикса > ДлинаНаименования Тогда 
		Заголовок = Лев(Заголовок, ДлинаНаименования - ДлинаПостфикса);
		ДлинаЗаголовка = СтрДлина(Заголовок);
		ПозицияПробела = ДлинаЗаголовка;
		Пока ПозицияПробела > 0 Цикл
			Если Сред(Заголовок, ПозицияПробела, 1) = " " Тогда
				Прервать;
			КонецЕсли;	
			ПозицияПробела = ПозицияПробела - 1;
		КонецЦикла;	
		Если ПозицияПробела > 1 Тогда 
			Заголовок = Лев(Заголовок, ПозицияПробела - 1);
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат Заголовок + Постфикс;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
